Catalogs/Сертификаты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Catalog>
		<Properties>
			<Name>Сертификаты</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Пользователи</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Срок</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИНН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПИНФЛ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>14</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Диск</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Путь</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Имя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Псевдоним</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тип</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыКонтрагента</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/Сертификаты/Ext/ManagerModule.bsl
Процедура Обновить(Сертификаты) Экспорт
	УстановитьПривилегированныйРежим(Истина);
	
	Список = Новый Массив;
	
	Для Каждого Сертификат Из Сертификаты Цикл
		ВыборкаСсылка = Справочники.Сертификаты.НайтиПоКоду(Сертификат.Код,,, ПараметрыСеанса.Пользователь);
		
		Если ВыборкаСсылка.Пустая() Тогда
			ВыборкаОбъект = Справочники.Сертификаты.СоздатьЭлемент();
        Иначе
			ВыборкаОбъект = ВыборкаСсылка.ПолучитьОбъект();
		КонецЕсли;
		
		ВыборкаОбъект.Код = Сертификат.Код;
		ВыборкаОбъект.Наименование = Сертификат.Наименование;
		ВыборкаОбъект.Владелец = ПараметрыСеанса.Пользователь;
		ВыборкаОбъект.Организация = Сертификат.Организация;
		ВыборкаОбъект.Срок = Сертификат.Срок;
		ВыборкаОбъект.ИНН = Сертификат.ИНН;
		ВыборкаОбъект.ПИНФЛ = Сертификат.ПИНФЛ;
		ВыборкаОбъект.Диск = Сертификат.Диск;
		ВыборкаОбъект.Путь = Сертификат.Путь;
		ВыборкаОбъект.Имя = Сертификат.Имя;
		ВыборкаОбъект.Псевдоним = Сертификат.Псевдоним;
		ВыборкаОбъект.Тип = Сертификат.Тип;
		ВыборкаОбъект.Записать();
		
		Список.Добавить(ВыборкаОбъект.Ссылка);
	КонецЦикла;
	
	Выборка = Справочники.Сертификаты.Выбрать(,ПараметрыСеанса.Пользователь);
	Пока Выборка.Следующий() Цикл
        Если Список.Найти(Выборка.Ссылка) = Неопределено Тогда
			ВыборкаОбъект = Выборка.ПолучитьОбъект();
			ВыборкаОбъект.Удалить();
		КонецЕсли;
	КонецЦикла;
	
	УстановитьПривилегированныйРежим(Ложь);
КонецПроцедуры
